[
  {
    "name": "Taj Mahal",
    "coords": [
      27.1751,
      78.0421
    ],
    "category": "monuments_and_architecture",
    "year": 1653,
    "location": "Agra, Uttar Pradesh",
    "built by": "Mughal Emperor Shah Jahan",
    "architecture type": "Mughal Architecture (Persian-Islamic-Indian blend)",
    "materials": "White marble, inlay gemstones, red sandstone",
    "key features": "Symmetry, white marble dome, minarets, pietra dura inlay work, charbagh garden",
    "brief": "An ivory-white marble mausoleum built as an eternal symbol of love.",
    "description": "The Taj Mahal, commissioned by Shah Jahan in memory of Mumtaz Mahal, is renowned for perfect symmetry, intricate marble inlay work, and a harmonious blend of Persian, Islamic, and Indian architectural elements. Its reflective pools, charbagh garden layout, and iconic central dome make it one of the most celebrated monuments globally. Declared a UNESCO World Heritage Site, it attracts millions of visitors annually.",
    "current status": "UNESCO World Heritage Site; major global tourist destination",
    "cultural importance": "Symbol of love, architectural excellence, and Mughal heritage.",
    "image_url": "images/Taj_Mahal.jpg"
  },
  {
    "name": "Red Fort",
    "coords": [
      28.6562,
      77.241
    ],
    "category": "monuments_and_architecture",
    "year": 1648,
    "location": "Old Delhi, Delhi",
    "built by": "Mughal Emperor Shah Jahan",
    "architecture_type": "Mughal Fort Architecture",
    "materials": "Red sandstone, marble",
    "key_features": "Massive walls, Lahori Gate, Diwan-i-Aam, Diwan-i-Khas, gardens",
    "brief": "A fortified palace that served as the residence of Mughal emperors.",
    "description": "Commissioned by Shah Jahan, the Red Fort served as the political and ceremonial center of the Mughal Empire. Its red sandstone walls house exquisite palaces, audience halls, and gardens illustrating Mughal grandeur. It is also the site where India's Prime Minister delivers the Independence Day speech.",
    "current status": "UNESCO World Heritage Site; national symbol of India",
    "cultural importance": "Strong symbol of sovereignty, Mughal culture, and Indian independence.",
    "image_url": "images/red_fort.jpg"
  },
  {
    "name": "Hawa Mahal",
    "coords": [
      26.9239,
      75.8267
    ],
    "category": "monuments_and_architecture",
    "year": 1799,
    "location": "Jaipur, Rajasthan",
    "built by": "Maharaja Sawai Pratap Singh",
    "architecture type": "Rajput Architecture",
    "materials": "Pink sandstone",
    "keyfeatures": "953 jharokhas (windows), honeycomb façade, five-storey structure",
    "brief": "A 'Palace of Winds' designed to allow royal women to observe festivities unseen.",
    "description": "Designed by Lal Chand Ustad, the Hawa Mahal exemplifies Rajput artistry through its façade of 953 small ventilated windows. It allowed royal women to witness street processions without exposure. Its pyramidal structure and pink sandstone material remain iconic to Jaipur's identity.",
    "current status": "Major landmark and tourist attraction in Jaipur",
    "cultural importance": "Represents Rajputana architectural sophistication and cultural traditions.",
    "image_url": "images/hawa_mahal.jpg"
  },
  {
    "name": "Ghats of Kashi",
    "coords": [
      25.3176,
      82.9739
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1400,
    "location": "Varanasi, Uttar Pradesh",
    "origin period": "c. 1400 CE (with older sacred references)",
    "built by": "Multiple dynasties including Marathas, Peshwas, and local rulers",
    "religion": "Hinduism",
    "architecture type": "Stone steps, riverfront architecture",
    "key features": "Ritual baths, cremation ghats, spiritual ceremonies, Ganga Aarti",
    "brief": "A sacred riverfront of Varanasi with steps leading to the Ganges, central to Hindu spirituality.",
    "description": "The Ghats of Kashi are a series of steps along the Ganges River used for ritual baths, prayers, and cremations. Revered for centuries, these ghats represent the spiritual heart of India, where devotees believe that bathing in the Ganga washes away sins. Daily Ganga Aarti, cremation rituals at Manikarnika Ghat, and continuous spiritual activity make this one of the holiest places for Hindus.",
    "cultural importance": "Symbol of Hindu ritual life and spiritual liberation.",
    "current status": "Major pilgrimage destination with daily rituals and global spiritual tourism.",
    "image_url": "images/kashi.jpg"
  },
  {
    "name": "Ajanta Caves",
    "coords": [
      20.5517,
      75.7032
    ],
    "category": "monuments_and_architecture",
    "year": 480,
    "location": "Aurangabad, Maharashtra",
    "built by": "Buddhist monks supported by Satavahana & Vakataka patrons",
    "architecture type": "Rock-cut Buddhist cave architecture",
    "materials": "Basalt rock",
    "key features": "Murals, sculptures, chaitya halls, vihara monasteries",
    "brief": "Ancient Buddhist cave monuments depicting Jataka tales in stunning murals.",
    "description": "Ajanta comprises 30 rock-cut caves illustrating Buddhist philosophy, art, and monastic life. The caves contain vibrant murals narrating Jataka tales and sculptures that reflect refined Indian artistry from 2nd century BCE to 480 CE. Its artistic legacy has influenced global art history.",
    "current status": "UNESCO World Heritage Site",
    "cultural importance": "One of the greatest achievements of ancient Indian art.",
    "image_url": "images/ajanta_caves.jpg"
  },
  {
    "name": "Madhubani Art",
    "coords": [
      26.3768,
      86.0717
    ],
    "category": "folk_arts_and_handcrafts",
    "year": 1500,
    "origin region": "Mithila region, Bihar",
    "origin period": "c. 1500 CE",
    "materials used": "Natural dyes, handmade paper, cloth, walls, bamboo pens",
    "art style type": "Folk Painting (Mithila Style)",
    "key features": "Geometric patterns, vibrant colors, mythological themes, ritual symbolism",
    "brief": "A traditional folk painting style known for geometric precision and vibrant natural colors.",
    "description": "Madhubani Art is a centuries-old painting tradition practised predominantly by women in the Mithila region. Traditionally painted on mud walls, it uses natural pigments derived from plants, flowers, and minerals. The style features intricate linework, double borders, depiction of deities, festivals, and village life. Its evolution from household ritual art to global recognition highlights the cultural richness and resilience of Mithila traditions.",
    "cultural importance": "A symbol of Mithila identity, women's artistic heritage, and India's folk art legacy.",
    "current status": "Widely practiced; globally recognized; promoted through government and artisan cooperatives.",
    "image_url": "images/art.jpg"
  },
  {
    "name": "Indian Pottery",
    "coords": [
      26.8467,
      80.9462
    ],
    "category": "folk_arts_and_handcrafts",
    "year": 1700,
    "origin region": "Pan-India (various regional schools)",
    "origin period": "c. 1700 CE",
    "materials used": "Clay, terracotta, glaze (in blue pottery), natural pigments",
    "art style type": "Traditional Craft",
    "key features": "Handcrafted pottery, terracotta figurines, regional variations like Jaipur blue pottery",
    "brief": "A traditional craft demonstrating the versatility and cultural depth of clay artistry in India.",
    "description": "Indian pottery encompasses diverse regional styles, including Jaipur blue pottery, West Bengal terracotta, Gujarat's clay toys, and rural earthenware. Artisans shape clay through age-old techniques such as hand molding, wheel throwing, and kiln firing. Pottery reflects everyday utility as well as ceremonial and decorative roles, carrying motifs inspired by nature, religion, and local customs.",
    "cultural importance": "Represents India's rural craftsmanship and centuries-old clay culture.",
    "current status": "Actively practiced; supported through craft clusters, exhibitions, and tourism.",
    "image_url": "images/craftsmen.jpg"
  },
  {
    "name": "Warli Painting",
    "coords": [
      19.9678,
      73.0805
    ],
    "category": "folk_arts_and_handcrafts",
    "year": 2500,
    "origin region": "Maharashtra (Warli Tribe)",
    "origin period": "c. 2500 BCE",
    "materials used": "Rice paste, bamboo sticks, red ochre walls",
    "art style type": "Tribal Art",
    "key features": "Simple geometric shapes, depiction of village life, human-nature harmony",
    "brief": "A tribal art form using basic geometric shapes to portray life, rituals, and nature.",
    "description": "Warli Painting, practiced by the Warli tribe, is one of India's oldest tribal art traditions. Painted originally on mud walls using rice paste, it employs circles, triangles, and squares to narrate stories of farming, festivals, dances, and deities. The central motif often includes the tarpa dance, symbolizing community life. Its minimalistic visual language reflects deep ecological understanding and harmony with nature.",
    "cultural importance": "A vital representation of tribal identity, ecological wisdom, and indigenous storytelling.",
    "current status": "Actively practiced; adapted into modern decor and commercial art while preserving tribal identity.",
    "image_url": "images/warli_painting.jpg"
  },
  {
    "name": "Kathak Dance",
    "coords": [
      26.8467,
      80.9462
    ],
    "category": "music_and_dance",
    "year": 1800,
    "origin region": "Uttar Pradesh, North India",
    "origin period": "c. 1800 CE (with ancient roots)",
    "created by": "Temple storytellers known as Kathakars",
    "instruments used": "Tabla, harmonium, sarangi, ghungroo (ankle bells)",
    "style features": "Intricate footwork, fast spins (chakkars), expressive storytelling, rhythmic patterns",
    "key features": "Narrative dance, Mughal court influence, sophisticated rhythm, expressive abhinaya",
    "brief": "A classical dance form known for storytelling, rhythmic footwork, and graceful spins.",
    "description": "Kathak originated from ancient temple storytellers, evolving significantly during the Mughal era when it absorbed Persian influences in movement and costume. Known for its percussive footwork, chakkars (spins), and expressive gestures, Kathak narrates mythological stories through rhythm and emotion. Today it is one of India's eight classical dance styles, performed on global stages.",
    "cultural importance": "Represents India's syncretic cultural blend of Hindu storytelling and Mughal aesthetics.",
    "current status": "Widely taught and performed; supported through classical academies and global dance platforms.",
    "image_url": "images/kathak.jpg"
  },
  {
    "name": "Manipuri Dance",
    "coords": [
      24.817,
      93.9368
    ],
    "category": "music_and_dance",
    "year": 1500,
    "origin region": "Manipur, Northeast India",
    "origin period": "c. 1500 CE",
    "created by": "Evolved through Vaishnavite traditions and temple rituals",
    "instruments used": "Pung (Manipuri drum), flute, cymbals",
    "style features": "Graceful, fluid movements, devotional expressions, circular patterns",
    "key features": "Soft gestures, colorful costumes, themes of Radha-Krishna devotion",
    "brief": "A classical dance form defined by fluidity, grace, and spiritual devotion.",
    "description": "Manipuri Dance is deeply rooted in the region's Vaishnavite traditions, particularly the Ras Lila. It features soft, rounded movements symbolizing spiritual devotion and divine love. Dancers wear elaborate costumes that accentuate flowing motions, while music played on the pung drum forms the rhythmic base. Its meditative style distinguishes it from other classical Indian dances.",
    "cultural importance": "Highlights the spiritual and cultural identity of Manipur while celebrating Vaishnavite devotion.",
    "current status": "Actively performed; preserved through cultural institutions and festivals across India.",
    "image_url": "images/manipuri_dance.jpg"
  },
  {
    "name": "Chole Bhature",
    "coords": [
      28.7041,
      77.1025
    ],
    "category": "cuisine",
    "year": 1940,
    "origin region": "Punjab & Delhi, North India",
    "origin period": "c. 1940 CE",
    "cultural group": "North Indian / Punjabi community",
    "ingredients": "Chickpeas (chole), spices, fermented dough (bhature), yogurt, oil",
    "preparation style": "Spiced chickpea curry paired with deep-fried fermented bread",
    "key features": "Tangy, spicy chole; soft, fluffy bhature; served with pickles and onions",
    "brief": "A beloved North Indian dish combining spicy chickpeas with deep-fried bread.",
    "description": "Chole Bhature is a popular comfort food from North India, known for its rich, spicy chickpea curry and airy bhature made from fermented dough. Often enjoyed as breakfast or a festive meal, it reflects Punjabi culinary boldness and Delhi's vibrant street-food culture. The dish has become a widespread favorite across India and abroad.",
    "cultural importance": "Represents North Indian hospitality, festive cuisine, and popular street food traditions.",
    "current status": "Widely available across India in dhabas, restaurants, and global Indian eateries.",
    "image_url": "images/chola_bhatura.jpg"
  },
  {
    "name": "Hyderabadi Haleem",
    "coords": [
      17.385,
      78.4867
    ],
    "category": "cuisine",
    "year": 1600,
    "origin region": "Hyderabad, Telangana",
    "origin period": "c. 1600 CE (introduced during the Mughal-Deccan era)",
    "cultural group": "Hyderabadi Muslim community",
    "ingredients": "Wheat, meat (usually mutton), lentils, ghee, spices",
    "preparation style": "Slow-cooked for hours until creamy using traditional pounding techniques",
    "key features": "Rich, high-protein stew; smooth texture; aromatic spices; cooked overnight",
    "brief": "A slow-cooked meat and wheat stew traditionally prepared during Ramadan.",
    "description": "Hyderabadi Haleem is a celebrated dish blending Arabian, Mughal, and Deccani culinary traditions. Made by simmering wheat, lentils, meat, and spices for long hours, it attains a smooth, paste-like consistency. Rich in nutrition, Haleem is closely linked to Ramadan and symbolizes Hyderabad's multicultural food heritage. It has earned GI-tag status due to its cultural significance.",
    "cultural importance": "A hallmark of Hyderabadi cuisine, representing communal harmony and festive culinary heritage.",
    "current status": "Extremely popular during Ramadan; widely sold across Hyderabad and exported worldwide.",
    "image_url": "images/hyderabadi_haleem.jpg"
  },
  {
    "name": "Jim Corbett National Park",
    "coords": [
      29.53,
      78.7747
    ],
    "category": "nature_and_wildlife",
    "year": 1936,
    "location": "Uttarakhand, India",
    "ecological region": "Himalayan foothills; moist deciduous forests and grasslands",
    "established year": 1936,
    "species involved": "Bengal tiger, elephants, leopards, deer, 600+ bird species",
    "human interaction_type": "Wildlife safari, eco-tourism, conservation research",
    "key features": "Oldest national park in India, riverine forests, tiger reserve, birdwatching",
    "ecological importance": "Critical tiger habitat; preserves rich Himalayan biodiversity.",
    "conservation legacy": "Part of Project Tiger; major contributor to tiger conservation awareness.",
    "description": "Jim Corbett National Park, established in 1936, is India's first national park and a major tiger conservation region. Spread across forests, rivers, and grasslands, it hosts a large variety of mammals and birds. Named after conservationist Jim Corbett, the park attracts wildlife enthusiasts and researchers, offering safaris and eco-tourism opportunities.",
    "image_url": "images/jim_corbett_national_park.jpg"
  },
  {
    "name": "Kaziranga National Park",
    "coords": [
      26.5775,
      93.1711
    ],
    "category": "nature_and_wildlife",
    "year": 1908,
    "location": "Assam, India",
    "ecological region": "Brahmaputra floodplains; grasslands and wetlands",
    "established year": 1908,
    "species involved": "One-horned rhinoceros, elephants, tigers, swamp deer, migratory birds",
    "human interaction type": "Safari tourism, conservation programs, anti-poaching operations",
    "key features": "Largest population of one-horned rhinos, wetlands ecosystem, UNESCO site",
    "ecological importance": "Vital refuge for rhinos and wetland biodiversity.",
    "conservation legacy": "Successful rhino conservation model; strong anti-poaching record.",
    "description": "Kaziranga National Park is renowned worldwide for protecting the endangered one-horned rhinoceros. Its vast wetlands, grasslands, and forests support diverse wildlife, including tigers and migratory birds. Recognized as a UNESCO World Heritage Site, Kaziranga represents one of India's most effective conservation landscapes.",
    "image_url": "images/kaziranga_national_park.jpg"
  },
  {
    "name": "Ranthambore National Park",
    "coords": [
      26.0173,
      76.5026
    ],
    "category": "nature_and_wildlife",
    "year": 1955,
    "location": "Rajasthan, India",
    "ecological region": "Dry deciduous forests; Aravalli-Vindhya junction",
    "established year": 1955,
    "species involved": "Bengal tigers, leopards, sloth bears, birds, crocodiles",
    "human interaction type": "Wildlife tourism, photography, conservation education",
    "key features": "Historic Ranthambore Fort, lakes, tiger sightings",
    "ecological importance": "Important dry-forest habitat for large carnivores.",
    "conservation legacy": "Significant contributor to tiger conservation through Project Tiger.",
    "description": "Ranthambore National Park blends natural beauty with royal heritage. Once a hunting ground for Rajput kings, the park now safeguards tigers and leopards. Its lakes and the ancient Ranthambore Fort create a unique environment that is popular among wildlife photographers.",
    "image_url": "images/ranthambore.jpg"
  },
  {
    "name": "Bandipur National Park",
    "coords": [
      11.815,
      76.6295
    ],
    "category": "nature_and_wildlife",
    "year": 1974,
    "location": "Karnataka, India",
    "ecological region": "Nilgiri Biosphere Reserve; tropical dry forests",
    "established year": 1974,
    "species involved": "Tigers, elephants, dholes, deer, exotic birds",
    "human interaction type": "Eco-tourism, wildlife research, conservation activities",
    "key features": "Part of Nilgiri reserve, tiger habitat, diverse flora and fauna",
    "ecological importance": "Protects key tiger and elephant corridors.",
    "conservation legacy": "Integral to India's Project Tiger and elephant conservation.",
    "description": "Bandipur National Park forms a crucial part of the Nilgiri Biosphere Reserve, housing tigers, elephants, and diverse wildlife. Its scenic landscapes and protected corridors make it one of India's premier wildlife reserves.",
    "image_url": "images/bandipur_tiger_reserve.jpg"
  },
  {
    "name": "Keoladeo National Park",
    "coords": [
      27.1591,
      77.5236
    ],
    "category": "nature_and_wildlife",
    "year": 1981,
    "location": "Bharatpur, Rajasthan",
    "ecological region": "Wetlands and marshes",
    "established year": 1981,
    "species involved": "Migratory birds, cranes, ducks, herons",
    "human interaction type": "Birdwatching, eco-tourism, research",
    "key features": "UNESCO bird sanctuary, rich migratory population",
    "ecological importance": "Critical habitat for migratory waterfowl.",
    "conservation legacy": "Internationally recognized for avian protection.",
    "description": "Keoladeo National Park, also known as Bharatpur Bird Sanctuary, is a UNESCO World Heritage Site famous for its thriving birdlife. The park attracts thousands of migratory birds from across the world, making it a key site for ornithology.",
    "image_url": "images/Keoladeo_National_Park.jpg"
  },
  {
    "name": "Sundarbans National Park",
    "coords": [
      21.9497,
      89.1833
    ],
    "category": "nature_and_wildlife",
    "year": 1984,
    "location": "West Bengal, India",
    "ecological region": "Mangrove forests; coastal delta of Ganga-Brahmaputra",
    "established year": 1984,
    "species involved": "Royal Bengal tiger, crocodiles, birds, mangrove species",
    "human interaction type": "Boat safaris, conservation efforts, research",
    "key features": "World's largest mangrove forest, tiger habitat, UNESCO site",
    "ecological importance": "Natural barrier protecting coasts; globally significant mangrove ecosystem.",
    "conservation legacy": "Key region for tiger adaptation studies and mangrove science.",
    "description": "The Sundarbans is the world's largest mangrove forest and a UNESCO World Heritage Site. Known for the Royal Bengal Tiger and rich biodiversity, it plays a crucial role in climate protection, ecology, and local livelihoods.",
    "image_url": "images/Sundarban_National_Park.jpg"
  },
  {
    "name": "Periyar National Park",
    "coords": [
      9.4669,
      77.236
    ],
    "category": "nature_and_wildlife",
    "year": 1950,
    "location": "Kerala, India",
    "ecological region": "Western Ghats; tropical forests",
    "established year": 1950,
    "species involved": "Elephants, tigers, langurs, birds",
    "human interaction type": "Boat safaris, eco-tourism, conservation",
    "key features": "Periyar Lake, elephant habitats",
    "ecological importance": "Preserves Western Ghats biodiversity.",
    "conservation legacy": "Important elephant reserve and tiger habitat.",
    "description": "Periyar National Park is renowned for its elephant populations and the scenic Periyar Lake. Situated in the Western Ghats, the park offers eco-tourism experiences that support wildlife preservation.",
    "image_url": "images/Periyar_National_Park.jpg"
  },
  {
    "name": "Valley of Flowers",
    "coords": [
      30.728,
      79.605
    ],
    "category": "nature_and_wildlife",
    "year": 1982,
    "location": "Uttarakhand, India",
    "ecological region": "Himalayan alpine meadows",
    "established year": 1982,
    "species involved": "Rare Himalayan flora, snow leopards, birds, pollinators",
    "human interaction type": "Trekking, botanical research, eco-tourism",
    "key features": "UNESCO site, alpine flowers, high-altitude biodiversity",
    "ecological importance": "Preserves endemic Himalayan plant species.",
    "conservation legacy": "One of the most pristine Himalayan ecosystems.",
    "description": "The Valley of Flowers National Park is a UNESCO site known for its breathtaking alpine meadows and rare flora. Botanists and trekkers visit to witness endemic plant species blooming during the monsoon.",
    "image_url": "images/Valley_of_flowers.jpg"
  },
  {
    "name": "Great Himalayan National Park",
    "coords": [
      31.78,
      77.35
    ],
    "category": "nature_and_wildlife",
    "year": 1999,
    "location": "Himachal Pradesh, India",
    "ecological region": "Western Himalayas; alpine forests and meadows",
    "established year": 1999,
    "species involved": "Snow leopard, Himalayan tahr, musk deer, rare birds",
    "human interaction type": "Trekking, controlled eco-tourism, research",
    "key features": "UNESCO site, high-altitude biodiversity",
    "ecological importance": "Important conservation zone for alpine species.",
    "conservation legacy": "Globally recognized for preserving Himalayan ecology.",
    "description": "Great Himalayan National Park protects diverse ecosystems, from forests to alpine meadows. Known for its rare and endangered species, it is a UNESCO World Heritage Site and a favorite for trekkers.",
    "image_url": "images/great_himalayan_national_park.jpg"
  },
  {
    "name": "Nanda Devi National Park",
    "coords": [
      30.43,
      79.65
    ],
    "category": "nature_and_wildlife",
    "year": 1982,
    "location": "Uttarakhand, India",
    "ecological region": "High-altitude Himalayan region",
    "established year": 1982,
    "species involved": "Snow leopard, Himalayan musk deer, birds",
    "human interaction type": "Restricted tourism, mountaineering (limited)",
    "key features": "Nanda Devi peak surroundings, UNESCO site",
    "ecological importance": "Critical protected zone for fragile alpine species.",
    "conservation legacy": "High-altitude conservation success, UNESCO recognition.",
    "description": "Nanda Devi National Park surrounds one of India's highest peaks and preserves rare Himalayan ecosystems. Due to its fragility, tourism is highly controlled, ensuring long-term ecological preservation.",
    "image_url": "images/Nanda_Devi_national_park.jpg"
  },
  {
    "name": "Jawai Leopard Reserve",
    "coords": [
      25.15,
      73.083
    ],
    "category": "nature_and_wildlife",
    "year": 2013,
    "location": "Rajasthan, India",
    "ecological region": "Granite hills; scrub forests",
    "established year": 2013,
    "species involved": "Leopards, birds, hyenas, crocodiles",
    "human interaction type": "Leopard safaris, community-based conservation",
    "key features": "Leopard sightings, granite rock formations",
    "ecological importance": "Model for human-wildlife coexistence.",
    "conservation legacy": "Successful community-supported reserve.",
    "description": "Jawai Leopard Reserve is known for frequent leopard sightings amid granite landscapes. It showcases a rare coexistence model where local communities and wildlife thrive together.",
    "image_url": "images/Jawai_Leopard.jpg"
  },
  {
    "name": "Gurez Valley",
    "coords": [
      34.64,
      74.85
    ],
    "category": "nature_and_wildlife",
    "year": 1800,
    "location": "Jammu & Kashmir, India",
    "ecological region": "Himalayan valley; subalpine climate",
    "established year": 1800,
    "species involved": "Himalayan wildlife including bears, birds, and wild goats",
    "human interaction type": "Tourism, cultural exploration",
    "key features": "Scenic valleys, native culture, meadows",
    "ecological importance": "Supports diverse Himalayan ecology.",
    "conservation legacy": "Emerging eco-tourism destination.",
    "description": "Gurez Valley is a remote Himalayan region known for breathtaking scenery, meadows, and cultural vibrance. Its pristine nature supports rare wildlife species.",
    "image_url": "images/Gurez_Valley.jpg"
  },
  {
    "name": "Loktak Lake",
    "coords": [
      24.496,
      93.818
    ],
    "category": "nature_and_wildlife",
    "year": 1700,
    "location": "Manipur, India",
    "ecological region": "Freshwater lake with floating phumdis",
    "established year": 1700,
    "species involved": "Sangai deer, aquatic birds, freshwater species",
    "human interaction type": "Fishing, tourism, conservation",
    "key features": "Floating islands (phumdis), unique ecosystem",
    "ecological importance": "Home to critically endangered Sangai deer.",
    "conservation legacy": "Keibul Lamjao National Park protects rare habitats.",
    "description": "Loktak Lake is famous for its floating phumdis and as the habitat of the endangered Sangai deer. It supports local livelihoods through fishing and tourism.",
    "image_url": "images/Loktak_Lake.jpg"
  },
  {
    "name": "Munnar",
    "coords": [
      10.0892,
      77.0597
    ],
    "category": "nature_and_wildlife",
    "year": 1895,
    "location": "Kerala, India",
    "ecological region": "Western Ghats; hill station ecology",
    "established year": 1895,
    "species involved": "Nilgiri tahr, birds, regional flora",
    "human interaction type": "Tourism, trekking, tea plantation economy",
    "key features": "Tea gardens, misty hills, waterfalls",
    "ecological importance": "Supports endemic species of Western Ghats.",
    "conservation legacy": "Important eco-tourism and biodiversity region.",
    "description": "Munnar is a scenic hill station known for lush tea plantations, rolling hills, and rich biodiversity. It is a popular destination for nature lovers.",
    "image_url": "images/Munnar_hillstation.jpg"
  },
  {
    "name": "Dal Lake",
    "coords": [
      34.11,
      74.87
    ],
    "category": "nature_and_wildlife",
    "year": 1400,
    "location": "Srinagar, Jammu & Kashmir",
    "ecological region": "Freshwater Himalayan lake",
    "established year": 1400,
    "species involved": "Fish, aquatic plants, migratory birds",
    "human interaction type": "Tourism, shikara boats, houseboats",
    "key features": "Shikaras, houseboats, floating gardens",
    "ecological importance": "Supports aquatic life and local economy.",
    "conservation legacy": "Cultural and ecological symbol of Kashmir.",
    "description": "Dal Lake is famous for its Shikara boats, floating gardens, and houseboats. It is a cultural and ecological icon of Kashmir.",
    "image_url": "images/Dal_Lake.jpg"
  },
  {
    "name": "Andaman and Nicobar Islands",
    "coords": [
      11.7401,
      92.6586
    ],
    "category": "nature_and_wildlife",
    "year": 1956,
    "location": "Bay of Bengal, India",
    "ecological region": "Tropical rainforests; coral reefs",
    "established year": 1956,
    "species involved": "Coral species, marine life, tropical birds",
    "human interaction type": "Eco-tourism, marine research, tribal cultures",
    "key features": "Beaches, coral reefs, rainforests",
    "ecological importance": "Biodiversity hotspot; vital coral ecosystems.",
    "conservation legacy": "Protected marine and forest areas.",
    "description": "The Andaman and Nicobar Islands are known for pristine beaches, coral reefs, and tropical forests. They host diverse marine life and indigenous tribes.",
    "image_url": "images/Andaman_and_nicobar.jpg"
  },
  {
    "name": "Cherrapunji",
    "coords": [
      25.3,
      91.7
    ],
    "category": "nature_and_wildlife",
    "year": 1900,
    "location": "Meghalaya, India",
    "ecological region": "Wettest region; subtropical forests",
    "established year": 1900,
    "species involved": "Dense flora, birds, insects",
    "human interaction type": "Eco-tourism, trekking",
    "key features": "Living root bridges, heavy rainfall",
    "ecological importance": "Unique bridges and forest systems.",
    "conservation legacy": "Promotes sustainable living practices.",
    "description": "Cherrapunji is one of the wettest places on Earth, known for its living root bridges crafted by the Khasi tribe and lush green landscapes.",
    "image_url": "images/Cherrapunji.jpg"
  },
  {
    "name": "Auroville",
    "coords": [
      12.0064,
      79.8106
    ],
    "category": "nature_and_wildlife",
    "year": 1968,
    "location": "Tamil Nadu, India",
    "ecological region": "Sustainable township; mixed ecology",
    "established year": 1968,
    "species involved": "Replanted forests, birds, butterflies",
    "human interaction type": "Eco-living, sustainability programs, tourism",
    "key features": "Eco-projects, unique architecture, organic farms",
    "ecological importance": "Model for ecological restoration and sustainable living.",
    "conservation legacy": "Significant reforestation and green energy initiatives.",
    "description": "Auroville is an experimental township promoting human unity and sustainability. It practices organic farming, renewable energy usage, and progressive ecology.",
    "image_url": "images/Auroville_pondicherry.jpg"
  },
  {
    "name": "Dudhsagar Falls",
    "coords": [
      15.3146,
      74.3146
    ],
    "category": "nature_and_wildlife",
    "year": 1900,
    "location": "Goa, India",
    "ecological region": "Western Ghats; tropical forests",
    "established year": 1900,
    "species involved": "Forest species, insects, birds",
    "human interaction type": "Tourism, trekking",
    "key features": "Four-tiered waterfall, lush forests",
    "ecological importance": "Supports Western Ghats biodiversity.",
    "conservation legacy": "Promotes eco-tourism awareness.",
    "description": "Dudhsagar Falls is a spectacular four-tiered waterfall surrounded by dense Western Ghats forests. It attracts trekkers and nature lovers.",
    "image_url": "images/Dudhsagar_falls.jpg"
  },
  {
    "name": "Western Ghats",
    "coords": [
      10.167,
      76.333
    ],
    "category": "nature_and_wildlife",
    "year": 1988,
    "location": "Western India (Maharashtra to Tamil Nadu)",
    "ecological region": "Tropical mountain range; biodiversity hotspot",
    "established year": 1988,
    "species involved": "Endemic flora and fauna, elephants, tigers, birds",
    "human interaction type": "Trekking, tourism, conservation research",
    "key features": "UNESCO site, ancient mountain chain, rich biodiversity",
    "ecological importance": "One of the world's top biodiversity hotspots.",
    "conservation legacy": "Massive conservation efforts to protect endemic species.",
    "description": "The Western Ghats are a UNESCO World Heritage Site and a major ecological hotspot hosting immense biodiversity, forests, rivers, and endemic species.",
    "image_url": "images/Western_Ghats.jpg"
  },
  {
    "name": "Diwali",
    "coords": [
      28.7041,
      77.1025
    ],
    "category": "festivals_and_traditions",
    "year": 500,
    "origin region": "Pan-India",
    "origin period": "c. 500 CE",
    "cultural group": "Hindu community (celebrated widely across many cultures)",
    "key features": "Lighting diyas, fireworks, rangoli, Lakshmi puja, sweets exchange",
    "brief": "The festival of lights celebrating the victory of light over darkness.",
    "description": "Diwali is India's most celebrated festival, symbolizing the triumph of good over evil, light over darkness, and knowledge over ignorance. Homes and streets are illuminated with oil lamps and lanterns, families perform Lakshmi puja, and communities celebrate with fireworks and festive meals. The festival's meaning varies across regions, including Rama's return to Ayodhya and the worship of Goddess Lakshmi.",
    "cultural importance": "A festival of unity, prosperity, and cultural identity connecting millions across religions and countries.",
    "current status": "National festival of India; celebrated globally with immense enthusiasm.",
    "image_url": "images/Diwali.jpg"
  },
  {
    "name": "Holi",
    "coords": [
      28.7041,
      77.1025
    ],
    "category": "festivals_and_traditions",
    "year": 400,
    "origin region": "North India",
    "origin period": "c. 400 CE",
    "cultural group": "Hindu community",
    "key features": "Color play, bonfires (Holika Dahan), music, dance, festive foods",
    "brief": "A vibrant festival celebrating spring, joy, and love.",
    "description": "Holi marks the arrival of spring and is celebrated through playful throwing of colored powders and water. The night before, Holika Dahan symbolizes the burning of evil and protection of good. Holi celebrations foster community bonding and joyous gatherings filled with music, dance, and festive treats like gujiya and thandai.",
    "cultural importance": "Symbolizes renewal, unity, and the victory of good; widely celebrated across the world.",
    "current status": "India's global festival; celebrated by millions internationally.",
    "image_url": "images/Holi.jpg"
  },
  {
    "name": "Durga Puja",
    "coords": [
      22.5726,
      88.3639
    ],
    "category": "festivals_and_traditions",
    "year": 1600,
    "origin region": "West Bengal",
    "origin period": "c. 1600 CE",
    "cultural group": "Bengali Hindu community",
    "key features": "Elaborate pandals, idol worship, cultural performances, rituals",
    "brief": "A grand festival honoring Goddess Durga's victory over Mahishasura.",
    "description": "Durga Puja is the cultural heartbeat of Bengal, marked by beautifully designed pandals, artistic idols, and days of celebrations including music, dance, feasts, and rituals. It reflects devotion and artistic brilliance, with craftsmen working months to prepare elaborate decorations and idols. The festival brings communities together in celebration and cultural expression.",
    "cultural importance": "A UNESCO-recognized cultural event showcasing Bengal's artistic and social identity.",
    "current status": "One of India's largest festivals; draws millions of visitors.",
    "image_url": "images/Chalta_Bagan_Durga_Puja_2019.jpg"
  },
  {
    "name": "Onam",
    "coords": [
      10.8505,
      76.2711
    ],
    "category": "festivals_and_traditions",
    "year": 800,
    "origin region": "Kerala",
    "origin period": "c. 800 CE",
    "cultural group": "Malayali Hindu community",
    "key features": "Pookalam (flower rangoli), Vallamkali boat race, Onasadya feast, cultural dances",
    "brief": "Kerala's harvest festival celebrating the return of King Mahabali.",
    "description": "Onam marks the mythical homecoming of King Mahabali and celebrates prosperity and unity. The festival includes elaborate floral decorations, traditional boat races, tiger dances, and a grand multicourse vegetarian feast called Onasadya. Onam reflects Kerala's cultural richness, communal harmony, and natural beauty.",
    "cultural importance": "Represents Kerala's heritage, inclusivity, and agricultural traditions.",
    "current status": "Kerala's largest festival; celebrated worldwide by Malayali communities.",
    "image_url": "images/Onam.jpg"
  },
  {
    "name": "Ganesh Chaturthi",
    "coords": [
      19.076,
      72.8777
    ],
    "category": "festivals_and_traditions",
    "year": 1893,
    "origin region": "Maharashtra",
    "origin period": "1893 CE (modern revival by Lokmanya Tilak)",
    "cultural group": "Hindu community",
    "key features": "Clay idols, community pandals, devotional songs, immersion ceremonies",
    "brief": "A vibrant festival celebrating the birth of Lord Ganesha.",
    "description": "Ganesh Chaturthi involves installing beautifully crafted idols of Lord Ganesha in homes and public pandals. The festival lasts around 10 days, marked by prayers, cultural events, and community gatherings. The immersion ceremony symbolizes the cycle of creation and dissolution.",
    "cultural importance": "Strengthens community bonds and celebrates Maharashtra's artistic traditions.",
    "current status": "Major festival in Maharashtra and Goa; widely celebrated globally.",
    "image_url": "images/Ganesh-chaturthi-l.jpg"
  },
  {
    "name": "Kumbh Mela",
    "coords": [
      25.4358,
      81.8463
    ],
    "category": "festivals_and_traditions",
    "year": 600,
    "origin region": "North India",
    "origin period": "c. 600 CE",
    "cultural group": "Hindu pilgrims, sadhus, akharas",
    "key features": "Mass river bathing, spiritual discourses, ascetic gatherings, rituals",
    "brief": "One of the world's largest spiritual gatherings held every 12 years.",
    "description": "Kumbh Mela rotates among four sacred river sites and attracts millions of pilgrims seeking spiritual purification through holy dips. The event gathers monks, ascetics, and devotees from across India, creating a massive confluence of faith, culture, and tradition.",
    "cultural importance": "Recognized by UNESCO as an intangible cultural heritage of humanity.",
    "current status": "One of the largest human gatherings on Earth.",
    "image_url": "images/Kumbh_Mela2001.jpg"
  },
  {
    "name": "Hornbill Festival",
    "coords": [
      25.6751,
      94.1053
    ],
    "category": "festivals_and_traditions",
    "year": 2000,
    "origin region": "Nagaland",
    "origin period": "2000 CE",
    "cultural group": "Naga tribes",
    "key features": "Tribal dances, music, crafts, food festivals, traditional games",
    "brief": "A vibrant cultural festival celebrating Nagaland's tribal heritage.",
    "description": "Hornbill Festival showcases the diverse cultures of Nagaland's tribes through dance, music, crafts, and cuisine. It promotes cultural preservation, tourism, and unity among different Naga tribes, offering visitors a rich cultural experience.",
    "cultural importance": "A key festival preserving tribal identity and promoting Northeast Indian culture.",
    "current status": "Internationally known cultural festival drawing global visitors.",
    "image_url": "images/Folk_dance_Hornbill_Festival.jpg"
  },
  {
    "name": "Pushkar Camel Fair",
    "coords": [
      26.4885,
      74.5519
    ],
    "category": "festivals_and_traditions",
    "year": 1800,
    "origin region": "Rajasthan",
    "origin period": "c. 1800 CE",
    "cultural group": "Rajasthani communities",
    "key features": "Camel trading, folk performances, competitions, rituals",
    "brief": "A traditional camel and livestock fair combined with cultural festivity.",
    "description": "The Pushkar Camel Fair is both a major livestock trading event and a vibrant cultural festival. It features camel races, folk dances, marketplaces, and rituals at the sacred Pushkar Lake. The fair represents rural Rajasthan's lifestyle, artistry, and pastoral heritage.",
    "cultural importance": "Preserves Rajasthan's desert culture and traditional animal husbandry practices.",
    "current status": "Major tourist attraction and cultural event.",
    "image_url": "images/Pushkar.-_Le_marché_aux_bestiaux_(1).jpg"
  },
  {
    "name": "Makar Sankranti",
    "coords": [
      28.7041,
      77.1025
    ],
    "category": "festivals_and_traditions",
    "year": 500,
    "origin region": "Pan-India",
    "origin period": "c. 500 CE",
    "cultural group": "Hindu community",
    "key features": "Kite flying, bonfires, sesame sweets, harvest celebrations",
    "brief": "A harvest festival marking the sun's transition into Capricorn.",
    "description": "Makar Sankranti is celebrated with kite festivals, traditional foods like til-gud, and community gatherings. It marks the end of winter and the beginning of longer days. Different regions celebrate it under various names like Pongal, Uttarayan, and Lohri.",
    "cultural importance": "Symbolizes prosperity, agricultural cycles, and cultural unity.",
    "current status": "Widely celebrated across India.",
    "image_url": "images/Makar_Sankranti.jpg"
  },
  {
    "name": "Rath Yatra",
    "coords": [
      19.8135,
      85.8312
    ],
    "category": "festivals_and_traditions",
    "year": 1100,
    "origin region": "Puri, Odisha",
    "origin period": "c. 1100 CE",
    "cultural group": "Hindu community",
    "key features": "Large chariots, processions, devotion to Lord Jagannath",
    "brief": "The famous chariot festival dedicated to Lord Jagannath.",
    "description": "Rath Yatra features massive wooden chariots carrying Lord Jagannath, Balabhadra, and Subhadra through the streets of Puri. Millions participate with devotion, making it one of India's grandest spiritual spectacles.",
    "cultural importance": "Represents devotion, unity, and Odisha's spiritual heritage.",
    "current status": "Major international pilgrimage event.",
    "image_url": "images/Rath_Yatra_Puri_07-11027.jpg"
  },
  {
    "name": "Hemis Festival",
    "coords": [
      33.9126,
      77.7126
    ],
    "category": "festivals_and_traditions",
    "year": 1672,
    "origin region": "Ladakh",
    "origin period": "1672 CE",
    "cultural group": "Buddhist community",
    "key features": "Masked dances, rituals, monastery celebrations",
    "brief": "A Buddhist festival honoring Guru Padmasambhava.",
    "description": "Held at Hemis Monastery, the festival features ritualistic masked dances called Cham, symbolizing the victory of good over evil. It is one of Ladakh's most culturally rich festivals and draws global tourists.",
    "cultural importance": "Preserves Ladakhi Buddhist culture and monastic traditions.",
    "current status": "Major cultural and spiritual event in Ladakh.",
    "image_url": "images/Hemis_monastery_monk_festival_III.jpg"
  },
  {
    "name": "Losar Festival",
    "coords": [
      34.1526,
      77.577
    ],
    "category": "festivals_and_traditions",
    "year": 100,
    "origin_region": "Tibetan & Himalayan regions",
    "origin period": "c. 100 CE",
    "cultural group": "Tibetan Buddhist community",
    "key features": "Prayer ceremonies, dances, family feasts, rituals",
    "brief": "The Tibetan New Year festival celebrating renewal and blessings.",
    "description": "Losar marks the Tibetan New Year with monastery rituals, traditional dances, offerings, and family gatherings. It symbolizes purification from past negativity and blessings for the coming year.",
    "cultural importance": "Essential to Tibetan identity and Himalayan Buddhist culture.",
    "current status": "Celebrated across Tibet, Ladakh, Sikkim, and global Tibetan communities.",
    "image_url": "images/losar_festival.jpg"
  },
  {
    "name": "Golden Temple",
    "coords": [
      31.62,
      74.8765
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1604,
    "location": "Amritsar, Punjab",
    "origin period": "1604 CE",
    "built by": "Guru Arjan Dev; later gilded by Maharaja Ranjit Singh",
    "religion": "Sikhism",
    "architecture type": "Sikh architecture with golden façade",
    "key features": "Golden sanctum, Amrit Sarovar, community kitchen (langar)",
    "brief": "The holiest Gurdwara of Sikhism, renowned for its golden architecture.",
    "description": "The Golden Temple, or Harmandir Sahib, stands as the spiritual center of Sikhism. Surrounded by the sacred Amrit Sarovar, the temple features gold-plated architecture, marble pathways, and continuous hymns. Its langar serves free meals to thousands daily, symbolizing equality and service.",
    "cultural importance": "Represents Sikh ideals of equality, devotion, and community service.",
    "current status": "One of India's most visited pilgrimage sites.",
    "image_url": "images/Golden_Temple_nighttime.jpg"
  },
  {
    "name": "Vaishno Devi Temple",
    "coords": [
      33.03,
      74.95
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1300,
    "location": "Katra, Jammu & Kashmir",
    "origin period": "c. 1300 CE",
    "built by": "Believed to have evolved through early Hindu worship traditions",
    "religion": "Hinduism",
    "architecture type": "Hill shrine architecture",
    "key features": "Trek-based pilgrimage, sacred cave, three pindis",
    "brief": "A major Hindu shrine dedicated to Goddess Vaishnavi.",
    "description": "Located in the Trikuta Mountains, Vaishno Devi Temple is one of India's most visited pilgrimage destinations. Devotees undertake a steep trek to reach the sacred cave housing three natural rock formations (pindis) representing the goddess. The shrine symbolizes devotion, endurance, and divine grace.",
    "cultural importance": "A center of Shakti worship and one of India's prime pilgrimage sites.",
    "current status": "Visited by millions annually with modern facilities for pilgrims.",
    "image_url": "images/Vaishno_Devi_Bhavan.jpg"
  },
  {
    "name": "Amarnath Cave",
    "coords": [
      34.2155,
      75.5036
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1850,
    "location": "Jammu & Kashmir, India",
    "origin period": "c. 1850 CE (modern pilgrimage); ancient mentions older",
    "built by": "Natural cave formation",
    "religion": "Hinduism",
    "architecture type": "Natural cave shrine",
    "key features": "Naturally formed ice Shiva Lingam, challenging trek",
    "brief": "A sacred Himalayan shrine containing a naturally formed ice Shiva Lingam.",
    "description": "Amarnath Cave is one of Hinduism's most revered pilgrimage sites. Inside the cave, a naturally formed ice stalagmite symbolizes Lord Shiva. Pilgrims undertake a difficult trek through snow and rugged terrain to reach the shrine, reflecting devotion, faith, and spiritual endurance.",
    "cultural importance": "Major center of Shaivite worship.",
    "current status": "Seasonal pilgrimage with strict safety regulations.",
    "image_url": "images/Lord_Amarnath.jpg"
  },
  {
    "name": "Tirupati Balaji Temple",
    "coords": [
      13.684,
      79.3499
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 300,
    "location": "Tirumala, Andhra Pradesh",
    "origin period": "c. 300 CE",
    "built by": "Early Tamil rulers; expanded by Vijayanagara Empire",
    "religion": "Hinduism",
    "architecture type": "Dravidian temple architecture",
    "key features": "Tonsure offering, laddu prasadam, gold-plated sanctum",
    "brief": "One of the world's most visited and wealthiest Hindu temples.",
    "description": "Dedicated to Lord Venkateswara, Tirupati Balaji attracts millions of devotees annually. The temple is renowned for its rituals, massive pilgrim management system, and the famous laddu prasadam. The temple's wealth and scale of operations reflect deep-rooted devotion and centuries-old tradition.",
    "cultural importance": "A major symbol of South Indian spirituality and temple culture.",
    "current status": "India's most visited pilgrimage destination.",
    "image_url": "images/Purva_Tirupati_Balaji.jpg"
  },
  {
    "name": "Puri Jagannath Temple",
    "coords": [
      19.8048,
      85.8182
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1161,
    "location": "Puri, Odisha",
    "origin period": "1161 CE",
    "built by": "King Anantavarman Chodaganga Deva",
    "religion": "Hinduism",
    "architecture type": "Kalinga architecture",
    "key features": "Rath Yatra, massive temple complex, wooden idols",
    "brief": "One of the Char Dham pilgrimage sites dedicated to Lord Jagannath.",
    "description": "Jagannath Temple is a sacred Hindu temple known for its unique wooden deities and grand Rath Yatra festival. Built in Kalinga architectural style, the temple is central to Odisha's spiritual identity and draws millions of devotees annually.",
    "cultural importance": "A pillar of Odisha's cultural and spiritual heritage.",
    "current status": "Active pilgrimage site with global devotees.",
    "image_url": "images/640px-Shri_Jagannath_temple.jpg"
  },
  {
    "name": "Khwaja Gharib Nawaz Dargah",
    "coords": [
      26.4565,
      74.6315
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1236,
    "location": "Ajmer, Rajasthan",
    "origin period": "1236 CE",
    "built by": "Followers of Sufi saint Moinuddin Chishti",
    "religion": "Islam (Sufism)",
    "architecture type": "Indo-Islamic dargah architecture",
    "key features": "Qawwali, offerings, white marble shrine",
    "brief": "A revered Sufi shrine open to people of all faiths.",
    "description": "The Dargah of Khwaja Moinuddin Chishti is one of India's most important Sufi shrines. Devotees visit to offer prayers, listen to qawwali, and seek blessings. The shrine symbolizes spiritual inclusivity and divine love.",
    "cultural importance": "Major center of Sufi tradition and communal harmony.",
    "current status": "Active pilgrimage destination with millions of annual visitors.",
    "image_url": "images/Khwaja_Garib_Nawaz.jpg"
  },
  {
    "name": "Badrinath Temple",
    "coords": [
      30.7433,
      79.4938
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 800,
    "location": "Uttarakhand, India",
    "origin period": "c. 800 CE",
    "built by": "Adi Shankaracharya (revival)",
    "religion": "Hinduism",
    "architecture type": "Himalayan temple architecture",
    "key features": "Char Dham site, hot springs, idol of Badrinarayan",
    "brief": "A major pilgrimage temple dedicated to Lord Vishnu.",
    "description": "Badrinath Temple is part of the Char Dham Yatra and sits in the Himalayan valley along the Alaknanda River. Dedicated to Lord Vishnu, it features colorful wooden architecture and attracts thousands of pilgrims each season.",
    "cultural importance": "Crucial to Hindu pilgrimage traditions.",
    "current status": "Major seasonal pilgrimage site.",
    "image_url": "images/Badrinath_temple_-_Uttarakhand.jpg"
  },
  {
    "name": "Kedarnath Temple",
    "coords": [
      30.7352,
      79.0669
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 800,
    "location": "Uttarakhand, India",
    "origin period": "c. 800 CE",
    "built by": "Believed to be established by Adi Shankaracharya",
    "religion": "Hinduism",
    "architecture type": "Stone temple; Himalayan architecture",
    "key features": "Jyotirlinga shrine, high-altitude location, pilgrimage trek",
    "brief": "One of the holiest Shiva temples located at high altitude.",
    "description": "Kedarnath Temple, one of the twelve Jyotirlingas, is located amidst the Himalayan peaks. Pilgrims trek through challenging terrain to reach the shrine. It represents deep devotion, resilience, and spiritual courage.",
    "cultural importance": "Major destination of Char Dham pilgrimage.",
    "current status": "Seasonal pilgrimage site with strong spiritual significance.",
    "image_url": "images/Kedarnath_Temple_in_Uttarakhand.jpg"
  },
  {
    "name": "Akshardham Temple",
    "coords": [
      28.6127,
      77.2773
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 2005,
    "location": "New Delhi, India",
    "origin period": "2005 CE",
    "built by": "BAPS Swaminarayan Sanstha",
    "religion": "Hinduism",
    "architecture type": "Modern stone temple architecture",
    "key features": "Intricate carvings, exhibitions, boat ride, musical fountains",
    "brief": "A modern Hindu temple complex showcasing Indian spirituality and architecture.",
    "description": "Akshardham Temple is a grand architectural complex featuring detailed carvings, cultural exhibitions, and spiritual displays. It represents traditional Indian craftsmanship combined with modern presentation techniques.",
    "cultural importance": "Promotes Indian culture, values, and spiritual heritage.",
    "current status": "Major tourist and pilgrimage attraction.",
    "image_url": "images/Akshardham_Lotus.jpg"
  },
  {
    "name": "Basilica of Bom Jesus",
    "coords": [
      15.5009,
      73.9116
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1605,
    "location": "Old Goa, India",
    "origin period": "1605 CE",
    "built by": "Portuguese colonial administration",
    "religion": "Christianity (Catholic)",
    "architecture type": "Baroque architecture",
    "key features": "Mortal remains of St. Francis Xavier, ornate interiors",
    "brief": "A UNESCO-listed basilica housing the relics of St. Francis Xavier.",
    "description": "Basilica of Bom Jesus is an iconic Baroque-style church in Goa, renowned for containing the preserved relics of St. Francis Xavier. Its elaborate interiors and historical significance attract millions of pilgrims and tourists.",
    "cultural importance": "Important center of Christian worship and heritage in India.",
    "current status": "UNESCO World Heritage Site; active church.",
    "image_url": "images/Side_Elevation_of_Basilica_of_Bom_Jesus.jpg"
  },
  {
    "name": "Sabarimala Temple",
    "coords": [
      9.4355,
      77.0811
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1100,
    "location": "Kerala, India",
    "origin period": "c. 1100 CE",
    "built by": "Early Hindu kings of Pandalam Kingdom",
    "religion": "Hinduism",
    "architecture type": "Hill shrine architecture",
    "key features": "Mandala season pilgrimage, strict rituals, forest route",
    "brief": "A major pilgrimage temple dedicated to Lord Ayyappan.",
    "description": "Sabarimala Temple attracts millions of devotees who follow strict 41-day vratham rituals before undertaking a challenging forest trek. The temple symbolizes discipline, devotion, and the spiritual journey toward purity.",
    "cultural importance": "One of India's largest annual pilgrimages.",
    "current status": "Active pilgrimage site with well-regulated access.",
    "image_url": "images/Sabarimala_temple.jpg"
  },
  {
    "name": "Sarnath",
    "coords": [
      25.377,
      83.0225
    ],
    "category": "spiritual_and_pilgrimage",
    "year": -500,
    "location": "Varanasi, Uttar Pradesh",
    "origin period": "c. 500 BCE",
    "built by": "Mauryan Emperor Ashoka (major expansions)",
    "religion": "Buddhism",
    "architecture type": "Stupas, monasteries, pillars",
    "key features": "Dhamek Stupa, Ashoka Pillar, excavation sites",
    "brief": "The site where Gautama Buddha delivered his first sermon.",
    "description": "Sarnath is one of Buddhism's holiest sites, where Buddha taught the Dharma for the first time. It houses stupas, monasteries, and the famous Ashoka Pillar, representing the birthplace of Buddhist monastic tradition.",
    "cultural importance": "Global center of Buddhist pilgrimage.",
    "current status": "Archaeological and spiritual site visited worldwide.",
    "image_url": "images/Ashoka_Pillar_at_Sarnath.jpg"
  },
  {
    "name": "Shirdi Sai Baba Temple",
    "coords": [
      19.7645,
      74.4764
    ],
    "category": "spiritual_and_pilgrimage",
    "year": 1922,
    "location": "Shirdi, Maharashtra",
    "origin_period": "1922 CE",
    "built by": "Devotees of Sai Baba",
    "religion": "Multi-faith (teachings emphasize unity)",
    "architecture type": "Modern temple architecture",
    "key features": "Samadhi of Sai Baba, daily aartis, charitable services",
    "brief": "A spiritual center dedicated to the teachings of Sai Baba.",
    "description": "Shirdi Sai Baba Temple houses the samadhi of Sai Baba, a revered spiritual figure who preached unity, compassion, and peaceful coexistence. Devotees visit from across the world to receive blessings and participate in rituals.",
    "cultural importance": "Symbol of universal brotherhood and spiritual harmony.",
    "current status": "One of India's most visited pilgrimage locations.",
    "image_url": "images/Shri_Saibaba_Samadhi_Temple_in_Shirdi.jpg"
  },
  {
    "name": "Ayodhya (Ramayan Heritage)",
    "coords": [
      26.799,
      82.204
    ],
    "category": "tales_and_epics",
    "epic": "ramayan",
    "year": -500,
    "location": "Ayodhya, Uttar Pradesh",
    "period": "c. 500 BCE (Epic Period)",
    "key features": "Birthplace of Lord Rama, ancient ghats, temples, epic references",
    "brief": "An ancient city central to the Ramayan, revered as the birthplace of Lord Rama.",
    "description": "Ayodhya plays a foundational role in the Ramayan, serving as the birthplace and kingdom of Lord Rama, hero of the epic. The city's landscape is filled with sacred sites mentioned in the Ramayan-such as Ram Janmabhoomi, Kanak Bhawan, and Sarayu Ghats. Ayodhya symbolizes dharma, devotion, and the values embodied by Rama. Its cultural significance spans thousands of years, influencing art, literature, and religious traditions of India.",
    "cultural importance": "A major center of Hindu devotion and a cornerstone of Ramayan heritage.",
    "image_url": "images/Tales_and_epics/Ramayan1%20%281%29.jpg"
  },
  {
    "name": "Kurukshetra (Mahabharat Heritage)",
    "coords": [
      29.967,
      76.817
    ],
    "category": "tales_and_epics",
    "epic": "mahabharat",
    "year": -300,
    "location": "Kurukshetra, Haryana",
    "period": "c. 300 BCE (Epic Period)",
    "key features": "Battlefield of Mahabharat, site of Bhagavad Gita, sacred tanks and temples",
    "brief": "The legendary battlefield where the Mahabharat war was fought and the Bhagavad Gita was delivered.",
    "description": "Kurukshetra holds immense significance in the Mahabharat as the site of the 18-day war between the Pandavas and Kauravas. It is also where Lord Krishna delivered the Bhagavad Gita's teachings to Arjuna, imparting timeless spiritual and philosophical wisdom. The region includes numerous pilgrimage sites such as Brahma Sarovar, Jyotisar, and ancient temples tied to various episodes of the epic.",
    "cultural importance": "A universal symbol of duty, righteousness, and spiritual knowledge.",
    "image_url": "images/Tales_and_epics/Mahabharat1%20%281%29.jpg"
  },
  {
    "name": "Mathura (Harivamsa Heritage)",
    "coords": [
      27.492,
      77.673
    ],
    "category": "tales_and_epics",
    "epic": "harivamsa",
    "year": -100,
    "location": "Mathura, Uttar Pradesh",
    "period": "c. 100 BCE",
    "key features": "Krishna's early life stories, temples, Yamuna ghats",
    "brief": "A sacred city associated with the early life and lineage of Lord Krishna.",
    "description": "Mathura is central to the Harivamsa, the supplementary text to the Mahabharat that elaborates Krishna's lineage and early life. The city is revered as Krishna's birthplace and contains significant sites like Krishna Janmabhoomi, Vishram Ghat, and numerous temples. Mathura's vibrant cultural traditions, especially during Janmashtami and Holi, reflect the deep devotion tied to Krishna's legends.",
    "cultural importance": "A major pilgrimage center representing Krishna's heritage and devotional traditions.",
    "image_url": "images/Tales_and_epics/Harivamsa1%20%281%29.jpg"
  }
]
